In [2]:
import numpy as np
import pandas as pd

In [3]:
np.random.seed(40)

In [4]:
#cria um dataframe com 4 linhas e 6 colunas, preenche com dados aleatorios e rotula 
df = pd.DataFrame(data=np.random.randn(4,6), index = 'A B C D'.split(), columns='U V W X Y Z'.split())

In [5]:
df

          U         V         W         X         Y         Z
A -0.607548 -0.126136 -0.684606  0.928715 -1.844401 -0.467002
B  2.292490  0.488810  0.710267  1.055534  0.054073  0.257953
C  0.588282  0.885244 -1.017007 -0.133693 -0.438186  0.493443
D -0.199009 -1.274984  0.293494  0.108950  0.031727  1.272640

In [6]:
#seleciona a coluna U
df['U']

A   -0.607548
B    2.292490
C    0.588282
D   -0.199009
Name: U, dtype: float64

In [7]:
#seleciona as colunas V e W
df[['V', 'W']]

          V         W
A -0.126136 -0.684606
B  0.488810  0.710267
C  0.885244 -1.017007
D -1.274984  0.293494

In [8]:
#tambem é possivel fazer dessa maneira
df.Z

A   -0.467002
B    0.257953
C    0.493443
D    1.272640
Name: Z, dtype: float64

In [9]:
#cria uma nova coluna que é a soma de W, X e Z
df['new'] = df['W'] + df['X'] + df['Z']

In [10]:
df

          U         V         W         X         Y         Z       new
A -0.607548 -0.126136 -0.684606  0.928715 -1.844401 -0.467002 -0.222894
B  2.292490  0.488810  0.710267  1.055534  0.054073  0.257953  2.023755
C  0.588282  0.885244 -1.017007 -0.133693 -0.438186  0.493443 -0.657257
D -0.199009 -1.274984  0.293494  0.108950  0.031727  1.272640  1.675084

In [11]:
#remove a coluna new
#inplace eh necessario para realizar as alteracoes de fato
df.drop('new', axis=1, inplace=True)

In [12]:
#retorna o dado que esta armazenado em determinada localizacao
df.loc['B', 'U']

2.2924903431515506

In [13]:
#permite localizar os dados utilizando indices numericos
df.iloc[0, 4]

-1.8444010340502783

In [14]:
df

          U         V         W         X         Y         Z
A -0.607548 -0.126136 -0.684606  0.928715 -1.844401 -0.467002
B  2.292490  0.488810  0.710267  1.055534  0.054073  0.257953
C  0.588282  0.885244 -1.017007 -0.133693 -0.438186  0.493443
D -0.199009 -1.274984  0.293494  0.108950  0.031727  1.272640

In [15]:
#retorna valores true ou false de acordo com a condicao
bol = df > 1

In [16]:
#printa apenas os valores true
df[bol]

         U   V   W         X   Y        Z
A      NaN NaN NaN       NaN NaN      NaN
B  2.29249 NaN NaN  1.055534 NaN      NaN
C      NaN NaN NaN       NaN NaN      NaN
D      NaN NaN NaN       NaN NaN  1.27264

In [17]:
#seleciona apenas as linhas onde o argumento passado eh valido
#nesse caso, apenas a linha onde o valor Y eh maior do que 0
df[df['Y'] > 0]

          U         V         W         X         Y         Z
B  2.292490  0.488810  0.710267  1.055534  0.054073  0.257953
D -0.199009 -1.274984  0.293494  0.108950  0.031727  1.272640

In [18]:
#mesma logica do exemplo anterior, mas mostra apenas a coluna U
df[df['Y'] > 0]['U']

B    2.292490
D   -0.199009
Name: U, dtype: float64

In [19]:
#os operadores logicos tambem podem restringir o resultado
df[(df['Y']>0) & (df['U']<0)]

          U         V         W        X         Y        Z
D -0.199009 -1.274984  0.293494  0.10895  0.031727  1.27264

In [20]:
#retorna os indices de volta para a coluna padrao baseada em numeros inteiros
df.reset_index(inplace=True)
df

  index         U         V         W         X         Y         Z
0     A -0.607548 -0.126136 -0.684606  0.928715 -1.844401 -0.467002
1     B  2.292490  0.488810  0.710267  1.055534  0.054073  0.257953
2     C  0.588282  0.885244 -1.017007 -0.133693 -0.438186  0.493443
3     D -0.199009 -1.274984  0.293494  0.108950  0.031727  1.272640

In [21]:
col = 'Civic Corsa Montana Fusca'.split()
col

['Civic', 'Corsa', 'Montana', 'Fusca']

In [22]:
#cria a coluna carros e adiciona os valores de col
df['Carros'] = col

In [23]:
df

  index         U         V         W         X         Y         Z   Carros
0     A -0.607548 -0.126136 -0.684606  0.928715 -1.844401 -0.467002    Civic
1     B  2.292490  0.488810  0.710267  1.055534  0.054073  0.257953    Corsa
2     C  0.588282  0.885244 -1.017007 -0.133693 -0.438186  0.493443  Montana
3     D -0.199009 -1.274984  0.293494  0.108950  0.031727  1.272640    Fusca

In [24]:
#transforma a coluna carros em um indice
df.set_index('Carros', inplace=True)
df

        index         U         V         W         X         Y         Z
Carros
Civic       A -0.607548 -0.126136 -0.684606  0.928715 -1.844401 -0.467002
Corsa       B  2.292490  0.488810  0.710267  1.055534  0.054073  0.257953
Montana     C  0.588282  0.885244 -1.017007 -0.133693 -0.438186  0.493443
Fusca       D -0.199009 -1.274984  0.293494  0.108950  0.031727  1.272640